line@0    @0    程序      子节点:[@1 @5 @9 @23]
line@1    @1    语句      声明语句    子节点:[@2 @3 @4]
line@1    @2    数据类型int
line@1    @3    变量      类型: int       名称: a           作用域: 0     符号表索引: 1     
line@1    @4    常量      类型: int       值: 0
line@2    @5    语句      声明语句    子节点:[@6 @7 @8]
line@2    @6    数据类型int
line@2    @7    变量      类型: int       名称: b           作用域: 0     符号表索引: 2     
line@2    @8    常量      类型: int       值: 2
line@7    @9    语句      if语句        子节点:[@10 @14 @18]
line@3    @10   表达式   运算符: ==    子节点:[@11 @13]
line@3    @11   表达式   运算符: !     子节点:[@12]
line@3    @12   常量      类型: int       值: 2
line@3    @13   常量      类型: int       值: 3
line@4    @14   语句      声明语句    子节点:[@15 @16 @17]
line@4    @15   数据类型int
line@4    @16   变量      类型: int       名称: a           作用域: 1     符号表索引: 1     
line@4    @17   常量      类型: int       值: 2
line@5    @18   语句      赋值语句    运算符: =     子节点:[@19 @20]
line@5    @19   变量      类型: int       名称: a           作用域: 1     符号表索引: 1     
line@5    @20   表达式   运算符: +     子节点:[@21 @22]
line@5    @21   变量      类型: int       名称: a           作用域: 1     符号表索引: 1     
line@5    @22   常量      类型: int       值: 2
line@9    @23   语句      while语句     子节点:[@24 @27]
line@7    @24   表达式   运算符: ==    子节点:[@25 @26]
line@7    @25   变量      类型: int       名称: a           作用域: 0     符号表索引: 1     
line@7    @26   变量      类型: int       名称: b           作用域: 0     符号表索引: 2     
line@8    @27   语句      标准输出语句子节点:[@28]
line@8    @28   变量      类型: int       名称: a           作用域: 0     符号表索引: 1     
