line@0    @0    程序      子节点:[@1 @4 @7 @10]
line@1    @1    语句      声明          子节点:[@2 @3]
line@1    @2    数据类型int
line@1    @3    变量      类型: int       名称: i           作用域: 0     符号表索引: 1     
line@2    @4    语句      声明          子节点:[@5 @6]
line@2    @5    数据类型int
line@2    @6    变量      类型: int       名称: b           作用域: 0     符号表索引: 2     
line@3    @7    语句      赋值语句    运算符: =     子节点:[@8 @9]
line@3    @8    变量      类型: int       名称: b           作用域: 0     符号表索引: 2     
line@3    @9    常量      类型: int       值: 10
line@6    @10   语句      for语句       子节点:[@11 @14 @17]
line@4    @11   语句      赋值语句    运算符: =     子节点:[@12 @13]
line@4    @12   变量      类型: int       名称: i           作用域: 0     符号表索引: 1     
line@4    @13   常量      类型: int       值: 0
line@4    @14   表达式   运算符: <     子节点:[@15 @16]
line@4    @15   变量      类型: int       名称: i           作用域: 0     符号表索引: 1     
line@4    @16   变量      类型: int       名称: b           作用域: 0     符号表索引: 2     
line@4    @17   表达式   运算符: 后++ 子节点:[@18]
line@4    @18   变量      类型: int       名称: i           作用域: 0     符号表索引: 1     
