line@0    @0    程序      子节点:[@1 @5 @9]
line@1    @1    语句      声明语句    子节点:[@2 @3 @4]
line@1    @2    数据类型int
line@1    @3    变量      类型: int       名称: a           作用域: 0     符号表索引: 1     
line@1    @4    常量      类型: int       值: 0
line@2    @5    语句      声明语句    子节点:[@6 @7 @8]
line@2    @6    数据类型int
line@2    @7    变量      类型: int       名称: b           作用域: 0     符号表索引: 2     
line@2    @8    常量      类型: int       值: 1
line@3    @9    语句      声明语句    子节点:[@10 @11 @12]
line@3    @10   数据类型int
line@3    @11   变量      类型: int       名称: c           作用域: 0     符号表索引: 3     
line@3    @12   常量      类型: int       值: 1
